Repository: 84000/data-translation-memory
Catalog: Toh_103-The_Teaching_by_the_Child_Inconceivable_Radiance-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཁྱེའུ་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་པས་བསྟན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས།
en: The Noble Account of Dharma The Teaching by the Child Inconceivable Radiance

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན། རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན།
en: The Bhagavān was residing in Śrāvastī, in the Jeta Grove of Anāthapiṇḍada’s park,

source: དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལྔ་བརྒྱ་ཙམ་དང་། ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །
en: together with a great saṅgha of one thousand two hundred and fifty bhikṣus and a full five hundred additional bodhisattvas.

source: དེ་ནས་བཅོམ་ལྡན་འདས་མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་གནས་ནས་བཞུགས་ཏེ།
en: While the Bhagavān was residing in the town of Śrāvastī,

source: རྒྱལ་པོ་དང་། བློན་པོ་ཆེན་པོ་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་དང་། གྲོང་རྡལ་གྱི་མི་དང་། ནང་མི་རྣམས་ཀྱིས་བསྟི་སྟང་དུ་བྱས། བཙུན་པར་བྱས། རི་མོར་བྱས། མཆོད་པ་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་བཟའ་བ་དང་། བཅའ་བ་དང་། བྱོག་པ་དང་། མྱང་བ་བཟང་པོ་མང་པོ་བརྙེས་སོ། །
en: its king and his senior ministers, the brahmins, householders, and people from the greater township, along with their families, paid respect, offered reverence and veneration, and presented offerings to the Bhagavān so that he received much fine food, drink, and other items to be eaten and sipped.

source: འདི་ལྟར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་
en: He was a blessed, thus-gone, worthy, perfect buddha, one with perfect knowledge and conduct, a blissful one, a knower of the world, a charioteer who tamed beings, an unexcelled being, and a teacher of gods and humans.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་རིགས་ཕུན་སུམ་ཚོགས་པ། གདུང་ཕུན་སུམ་ཚོགས་པ། ཆོ་རིགས་ཕུན་སུམ་ཚོགས་པ། ཚུལ་ཁྲིམས་ཕུན་སུམ་ཚོགས་པ། ཏིང་ངེ་འཛིན་ཕུན་སུམ་ཚོགས་པ། ཤེས་རབ་ཕུན་སུམ་ཚོགས་པ། རྣམ་པར་གྲོལ་བ་ཕུན་སུམ་ཚོགས་པ། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་གཟིགས་པ་ཕུན་སུམ་ཚོགས་པའོ་ཞེས།
en: The Blessed Buddha was renowned for his outstanding caste, outstanding clan, outstanding patrilineage, outstanding discipline, outstanding absorption, outstanding insight, outstanding liberation, and outstanding wisdom vision of liberation.

source: བཅོམ་ལྡན་འདས་ཀྱི་གྲགས་པའི་སྒྲ་དང་། སྙན་པ་འཇིག་རྟེན་དུ་རྒྱ་ཆེར་མངོན་དུ་བྱུང་བར་གྱུར་ཏོ། །
en: The Bhagavān’s fame and renown was thus widespread throughout the world.

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཆོས་ཀྱང་སྟོན་ཏེ།
en: The Blissful One, the knower of the world, the charioteer who tames beings, the unexcelled being, the teacher of gods and humans, the blessed Buddha, was also teaching the Dharma.

source: ཚངས་པར་སྤྱོད་པ། ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བ། དོན་བཟང་པོ། ཚིག་འབྲུ་བཟང་པོ། མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ། ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ། ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། །
en: That is, he was genuinely and fully teaching the sanctified conduct: what is virtuous at first, in the interim, and in the end, what has excellent meaning and excellent words, and what is unadulterated, perfect, pure, and cleansed.

source: སྤྱན་ལྔ་དང་ཡང་ལྡན་ཏེ།
en: He was also in possession of the five eyes,

source: ཤའི་སྤྱན་དང་། ལྷའི་སྤྱན་དང་། ཆོས་ཀྱི་སྤྱན་དང་། ཤེས་རབ་ཀྱི་སྤྱན་དང་། སངས་རྒྱས་ཀྱི་སྤྱན་དང་ལྡན་ནོ། །
en: namely the eye of flesh, the divine eye, the eye of Dharma, the eye of insight, and the eye of a buddha.

source: བཅོམ་ལྡན་འདས་ཀྱིས་གཞན་མུ་སྟེགས་ཅན་སྤྱོད་པ་པ་དང་། ཀུན་ཏུ་རྒྱུ་དང་། གཅེར་བུ་པ་གཉེན་གྱི་བུ་རྣམས་ནི་ཚར་བཅད་དོ། །
en: The Bhagavān had soundly defeated non-Buddhist schools such as the carakas, the parivrājakas, and the followers of the Nirgrantha Jñātiputra.

source: བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་འདི་ལྷ་དང་མི་རྣམས་ཀྱིས་ཡང་དག་པར་བཟུང་ཞིང་འབར་རོ། །
en: Gods and humans wholly adopted the Bhagavān’s teachings and so they spread everywhere.

source: དེ་ནས་བཅོམ་ལྡན་འདས་སྔ་དྲོའི་དུས་ཀྱི་ཚེ་ཆོས་གོས་དང་ཤམ་ཐབས་མནབས་ཏེ།
en: Early one morning, the Bhagavān dressed in his Dharma robes and skirt and

source: ལྷུང་བཟེད་བསྣམས་ནས་དགེ་སློང་གི་ཚོགས་དགེ་སློང་གི་དགེ་འདུན་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ།
en: took up his alms bowl. The assembly of bhikṣus, the saṅgha of bhikṣus, along with the bodhisattva mahāsattvas, surrounded him and accompanied him.

source: མདུན་དུ་གཟིགས་པ་དང་། གཡས་གཡོན་དུ་གཟིགས་པ་མཛེས་པ་དང་། བསྐུམ་པ་དང་། བརྐྱང་བ་མཛེས་པ་དང་།
en: He was beautiful to behold from the front, the right, and the left; his strides were beautiful.

source: ཆོས་གོས་སྣམ་སྦྱར་དང་། བསིལ་ཟན་དང་། ན་བཟའི་ཚགས་དང་། ལྷུང་བཟེད་བསྣམས་པ་མཛེས་པ་དང་།
en: Wearing the Dharma robes—the outer robe, the upper robe, and the inner robe—and the strainer and the alms bowl, he was beautiful.

source: སྐུ་མདོག་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་དང་། འོད་འདོམ་གང་བས་མཚན་མོ་མུན་པ་མུན་ནག་གི་ནང་ན་མེའི་ཕུང་པོ་ལྟ་བུ་དང་།
en: His complexion was golden, and he radiated an aura of light a full arm span around him. It was like a mass of fire amidst the darkness of night,

source: ཚེས་བཅོ་ལྔའི་ཟླ་བ་ཉ་བ་ལྟ་བུ་དང་། ཉི་མ་ཤར་བ་ལྟ་བུར་ཕྱོགས་སུ་སྣང་ཞིང་སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་ནི་ལྡན་ཏེ
en: like the full moon on the fifteenth lunar day, and like the shining of the sun. He possessed the thirty-two signs of a superior being.

source: གྲོང་ཁྱེར་ཆེན་པོར་མཉན་ཡོད་དུ་བསོད་སྙོམས་ཀྱི་ཕྱིར་གཤེགས་ནས།
en: They went to receive alms in the town of Śrāvastī,

source: བཅོམ་ལྡན་འདས་ཀྱིས་སྒོའི་ཐེམ་པ་ལ་ཞབས་བཞག་མ་ཐག་ཏུ། དེ་ནས་མཉན་ཡོད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་གྲོང་ཁྱེར་དུ་གཤེགས་པ་ན།
en: and at the very moment that the Bhagavān set his foot down at the threshold of the gate, reaching the town,

source: ཆོ་འཕྲུལ་ངོ་མཚར་རྨད་དུ་བྱུང་བ་ཆོས་རྣམ་པ་འདི་དག་བྱུང་སྟེ།
en: some magnificent, amazing, miraculous feats took place.

source: སྐྱེས་བུ་དམ་པ་འདྲེན་པ་དེ་གཤེགས་པའི་ཚེ། དེར་ཆོ་འཕྲུལ་རྨད་དུ་བྱུང་བ་ཆེན་པོ་གང་དག་བྱུང་བ་དེ་དག་བརྗོད་པར་བྱ།
en: I shall recount the incredible, great miracles that occurred when the holy being, the Guide, arrived,

source: ཤིན་ཏུ་དད་པའི་སེམས་ཀྱིས་ཉོན་ཅིག །
en: so listen with a most faithful heart.

source: ལོང་བ་རྣམས་ཀྱིས་ནི་མཐོང་ངོ་། །
en: Those who were blind were able to see.

source: འོན་པ་རྣམས་ཀྱིས་ནི་ཐོས་སོ། །
en: Those who were deaf were able to hear.

source: གཅེར་བུ་རྣམས་ཀྱིས་ནི་གོས་རྙེད་དོ། །
en: The naked found clothing.

source: སྨྱོན་པ་རྣམས་ཀྱིས་ནི་དྲན་པ་ཐོབ་པོ། །
en: Those with mental illness regained their faculties.

source: གྲོང་ཁྱེར་གྱི་སྐྱེ་བོ་ཐམས་ཅད་ནི་ཐལ་མོ་སྦྱར་ཏེ།
en: All the townsfolk joined their palms in reverence,

source: བདེ་བར་གཤེགས་པ་ལ་ཕྱག་འཚལ་ལོ། །
en: offering homage to the Blissful One.

source: རྔ་བོ་ཆེ་དང་རྫ་རྔ་དང་ཁར་རྔ་དང་། སྒྲ་སྙན་དག་ནི་མ་བརྡུངས་པར་སྒྲ་འབྱུང་ངོ་། །
en: The pleasant sounds of great gongs, earthen drums, and steel drums were audible, although none were struck.

source: ངང་པ་དང་། ངུར་པ་དང་། ཁྲུང་ཁྲུང་དང་། རྨ་བྱ་དང་། ནེ་ཙོ་དང་། ཁུ་བྱུག་དག་ཀྱང་ཡིད་དུ་འོང་བའི་སྒྲ་འབྱིན་ཏོ། །
en: Ducks, geese, herons, peacocks, parrots, and cuckoos voiced their delightful songs.

source: གང་དག་གཏེར་སྟོར་བ་དེ་དག་གིས་ནི་གཏེར་རྣམས་རྙེད་པར་གྱུར་ཏོ། །
en: Those who had lost their fortunes recovered them.

source: གསེར་དང་དངུལ་ལས་བྱས་པའི་སྣོད་རྣམས་ཀྱང་མ་དཀྲོལ་བར་སྒྲ་བྱུང་ངོ་། །
en: Vessels made of gold and silver rang out, although none were struck.

source: ས་ཡང་རྣམ་པ་དྲུག་ཏུ་གཡོས་ཤིང་འགུལ་ཏེ།
en: The earth itself rumbled and shook six times,

source: སེམས་ཅན་རྣམས་སྐྱབས་མེད་པར་ཡང་མ་གྱུར་ཅིག །
en: and no beings were left without refuge,

source: ཡིད་དང་བ་རབ་ཏུ་ཐོབ་བོ། །
en: as their minds were filled with sincere trust.

source: སྨྲ་བའི་མཆོག་དམ་པ་སངས་རྒྱས་ཀྱིས་གང་དང་གང་དུ་ཞབས་ཀྱིས་གོམ་པ་བོར་བ་དེ་དང་དེར་པད་མ་དྲི་མ་མེད་ཅིང་། ལེགས་པར་གནས་པ་རྣམས་བྱུང་ངོ་། །
en: Wherever strode the feet of the most eloquent and holy Buddha, there appeared immaculate lotuses in elegant arrangements.

source: དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བའི་སེམས་ཅན་གང་དག་གིས་མཐོང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་བདེ་བ་རྙེད་ནས་མཐོ་རིས་སུ་སྐྱེ་བར་འགྱུར་རོ། །
en: Those beings born in the animal realm who saw him found happiness and would be reborn in the higher realms.

source: བུད་མེད་གང་དག་སྦྲུམ་པ་དེ་དག་ཀྱང་མི་བདེ་བ་མེད་པ་ཉིད་དུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་པ་དག་བཙས་སོ། །
en: Those women who were pregnant gave birth, without the slightest discomfort, to fine-featured, attractive babies.

source: སེམས་ཅན་རྣམས་ལ་ཡང་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་རྣམས་ཀྱིས་གནོད་པར་གྱུར་པ་མེད་དོ། །
en: No beings harmed one another out of attachment, aversion, or indifference.

source: རབ་ཏུ་སྡང་བའི་སེམས་མེད་པར་ཕན་ཚུན་དུ་སྨྲ་སྟེ།
en: They spoke to one another in the most non-aggressive manner,

source: དཔེར་ན་ཕའམ་མ་ཞིག་བུ་གཅིག་པ་ལ་སྨྲ་བ་བཞིན་ནོ། །
en: the way a father or mother would speak to an only child.

source: སྲང་གི་གཡས་གཡོན་རྣམས་ཀྱང་ལེགས་པར་བརྒྱན་པར་གྱུར་ཏོ། །
en: The sides of the road became beautifully decorated.

source: ནམ་མཁའ་ལ་གནས་པའི་ལྷའི་ཚོགས་ཐམས་ཅད་ཀྱིས་ཀྱང་མེ་ཏོག་སིལ་མ་དག་མངོན་པར་གཏོར་ཏོ། །
en: All the gods dwelling in the heavens above copiously tossed flower petals.

source: སེམས་ཅན་སྡུག་བསྔལ་བར་གྱུར་པ་གང་ཡང་མེད་དོ། །
en: There were no beings left who underwent suffering.

source: སེམས་ཅན་གང་དག་ན་བར་གྱུར་པ་དེ་དག་ཀྱང་ནད་མེད་པར་གྱུར་ཏེ། བདེ་བ་ཐོབ་བོ། །
en: Beings who had been ill became free from illness and so felt happy.

source: བདེ་བར་གཤེགས་པ་གཤེགས་པ་ན་སེམས་ཅན་སོ་སོ་ནས་དེ་བཞིན་གཤེགས་པ་ཅི་བདག་ཁོ་ན་ལ་གཟིགས་སོ་སྙམ་དུ་སེམས་སོ། །
en: As the Blissful One passed by, each person wondered, “Is the Tathāgata looking at me alone?”

source: སོ་སོ་ནས་བདག་ཉིད་བསོད་སྙོམས་འབུལ་ཞིང་། མིའི་འདྲེན་པ་ལ་བརྟེན་ནས་བདག་ཁོ་ན་བསོད་སྙོམས་ཀྱི་འབྲས་བུ་ལ་སྦྱོར་རོ་སྙམ་དུ་སེམས་ཏེ།
en: They each thought, “I shall make my own offering of alms and so reap the exact result of offering alms to the guide of humans.”

source: དེ་གཤེགས་པ་ཙམ་ཡང་གཞལ་བར་སླ་བ་མ་ཡིན་ནོ། །
en: It was not at all easy to fathom what occurred just from him passing by.

source: དེ་ནས་བཅོམ་ལྡན་འདས་གྲོང་ཁྱེར་ཆེན་པོ་མཉན་ཡོད་དུ་མཐར་ཆགས་སུ་བསོད་སྙོམས་བཞེས་ཤིང་གཤེགས་ནས།
en: Then, the Bhagavān went out to receive alms, making his rounds through the town of Śrāvastī.

source: བཅོམ་ལྡན་འདས་གྲོང་བར་གྱི་དབུས་ཞིག་ཏུ་གཤེགས་པ་དང་། དེའི་ཚེ་ཁང་སྟོང་ཞིག་ཏུ་ཁྱེའུ་གཟུགས་བཟང་བ། མཛེས་པ། བལྟ་ན་སྡུག་པ་ཞིག་བོར་བར་གྱུར་ཏེ།
en: The Bhagavān reached a place near the center of town where a fine-figured, lovely, and attractive child had been left all alone inside a deserted dwelling.

source: ལག་པ་གཡས་པའི་མཛུབ་མོ་ཁར་བཅུག་ནས།
en: The child was sitting there sucking on his right thumb.

source: འཇིབ་ཅིང་འདུག་པ་ལ་ཁྱིའམ། ཅེ་སྤྱང་གང་དག་ཁང་སྟོང་དེར་ལྷགས་པ་དེ་དག་ཀྱང་ཁྱེའུ་དེ་ལ་ལྕེའི་དབང་པོས་བལྡགས་ཤིང་འདོང་སྟེ།
en: A number of dogs, or jackals, had gathered inside the empty house and were approaching the child and licking him.

source: ཇི་ལྟར་སྔོན་བྱས་པའི་དགེ་བའི་རྩ་བས་ཁྱེའུ་དེ་ལ་འཚེ་བ་མི་བྱེད་དོ། །
en: However, due to his past virtues, these animals caused no harm to the young child.

source: ཁང་སྟོང་དེར་སྐྱེ་བོ་ཕལ་པོ་ཆེ་དག་ཀྱང་འཇུག་ཅིང་འབྱུང་ངོ་། །
en: Some of the townsfolk were also going in and out of the deserted building.

source: བཅོམ་ལྡན་འདས་ཀྱིས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་འཇུག་ཅིང་འབྱུང་བ་གཟིགས་ནས་མཁྱེན་བཞིན་དུ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: Seeing the townsfolk coming and going, the Bhagavān knowingly directed Venerable Ānanda,

source: ཀུན་དགའ་བོ་གང་དུ་སྐྱེ་བོ་ཕལ་པོ་ཆེ་འདི་དག་འཇུག་ཅིང་འབྱུང་བའི་ཁང་སྟོང་དེ་ན་ཅི་ཡོད་ལྟོས།
en: “Ānanda, go and see what is inside that deserted house, the one all those townsfolk are entering and leaving.”

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་མཉན་ཏེ། ཁང་སྟོང་ག་ལ་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་ཁྱེའུ་གཟུགས་བཟང་བ། མཛེས་པ། བལྟ་ན་སྡུག་པ་ཞིག་ལག་པ་གཡས་པའི་མཛུབ་མོ་ཁར་བཅུག་སྟེ། འཇིབ་ཅིང་འདུག་ལ་མིག་གཉིས་མི་འཛུམས་པར་སྐྱེ་བོའི་ཚོགས་ཐམས་ཅད་ལ་ལྟ་བ་མཐོང་ངོ་། །
en: As he had been commanded by the Bhagavān, Venerable Ānanda went to the deserted house, and upon arriving saw a fine-figured child, beautiful and lovely to behold, sitting there sucking on his right thumb and staring openly at the crowd of people around him.

source: མཐོང་ནས་ཀྱང་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ལ་སྐབས་དེ་གསོལ་པ།
en: After seeing this, Venerable Ānanda returned to the Bhagavān and reported,

source: བཅོམ་ལྡན་འདས་ཁང་སྟོང་དེ་ན་ཁྱེའུ་བོར་བ་གཟུགས་བཟང་བ། མཛེས་པ། བལྟ་ན་སྡུག་པ། རིན་པོ་ཆེའི་གཟུགས་ལྟར་མཆིས་པ།
en: “Bhagavān, inside that deserted house is an abandoned child whose body is well formed, beautiful, and attractive, like a precious jewel.

source: མིག་མི་འཛུམས་པར་སྐྱེ་བོའི་ཚོགས་ཐམས་ཅད་ལ་ལྟ་བ་ཞིག་མཆིས་སོ། །
en: He sits there gazing with wide eyes at all the people gathered around him.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱེ་མ་ཁྱེའུ་འདི་ནི་སྔོན་གྱི་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ་སྟེ། ངའི་ལེགས་པར་བཤད་པའི་དོན་ཤེས་པར་ནུས་ཤིང་། སྐལ་བ་ཅན་ནོ་སྙམ་ནས།
en: The Bhagavān thought, “Aha! This child, through his outstanding training in previous lives, has the ability to understand the meaning of my teachings, and so is most fortunate!”

source: ཁྱེའུ་དེ་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོ་ཕལ་པོ་ཆེ་དགེ་བ་ལ་གཟུད་པའི་ཕྱིར། ཁང་སྟོང་ག་ལ་བ་དེར་གཤེགས་སོ། །
en: Out of affection for that child, and in order to lead the common folk to virtue, he went to the deserted dwelling.

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེར་གཤེགས་ནས་ཕྱོགས་གཅིག་ཏུ་བཞུགས་ཏེ།
en: When the Bhagavān reached the dwelling, he entered and

source: ཕྱོགས་གཅིག་ཏུ་བཞུགས་ནས། ཁྱེའུ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: took a seat to the side of the child and then addressed the following verse to him:

source: སྦྲུལ་དང་གནོད་སྦྱིན་རྒྱུ་བ་ཡི། །དུར་ཁྲོད་འཇིགས་པ་ཆེ་འདི་ན། །
en: “Frequented by snakes and yakṣas, This charnel ground is most frightening.

source: བྱིས་པ་ཇི་ལྟར་མི་འཇིགས་ཤིང་། །ཁྱོད་ད་གཅིག་པུ་འདི་ན་འདུག །
en: How could a child not be frightened here?And yet, here you are now, all alone!”

source: དེ་ནས་ཁྱེའུ་དེས་སངས་རྒྱས་ཀྱི་མཐུ་དང་། རང་གི་སྔོན་གྱི་དགེ་བའི་རྩ་བས། བཅོམ་ལྡན་འདས་ལ་སླར་ཚིགས་སུ་བཅད་དེ་གསོལ་པ།
en: Through the power of the Buddha and as a result of his own prior roots of virtue, the child then responded to the Bhagavān with these verses:

source: !བདག་མ་མཆིས་པའི་ཚོགས་རྣམས་ལ། །ཐུབ་པའི་དབང་ཕྱུག་སུ་ཞིག་འཇིགས། །
en: “Mighty Sage, who should feel fear Toward phenomena that have no self-identity?

source: ཐམས་ཅད་མཁྱེན་པ་སྨྲ་བའི་མཆོག །ཇི་ལྟར་འདིར་མཆིས་ལས་གང་ལགས། །
en: Omniscient One, supreme speaker, Whatever the action through which I came to be here,

source: བདག་གཅིག་བདག་གིས་གང་མ་མཆིས། །
en: “There is no self nor something done by a self.

source: བདག་ཀྱང་གང་གིའང་མ་ལགས་ཏེ། །
en: For the self does not belong to anything at all;

source: བདག་ནི་སུའི་ལགས་དེ་མ་མཐོང་། །
en: I see no self belonging to someone,

source: བདག་གི་སུ་ལགས་དེ་མ་མཐོང་། །
en: Nor do I see someone belonging to a self.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། །
en: The Bhagavān replied:

source: སྔོན་ཅད་སྡིག་པ་བྱས་པའི་ལས། །དེ་ཡི་རྣམ་སྨིན་འདི་འདྲ་སྟེ། །
en: “Evil actions performed in the past Have ripened in this way.

source: ཁང་པ་སྟོང་པ་འདིར་བོར་ནས། །
en: Abandoned in this deserted house,

source: སྡུག་བསྔལ་ཚོར་བ་མྱོང་བ་ཡིན། །
en: Surely you are experiencing feelings of suffering.”

source: ཁྱེའུས་གསོལ་པ།
en: The child asked:

source: གཽ་ཏམ་ཁང་སྟོང་སྙམ་པ་ཡི། །འདུ་ཤེས་ད་དུང་མངའ་བ་བལྟ། །
en: “Gautama, do you still perceive That there is a deserted house?

source: བྱང་ཆུབ་སྙིང་པོར་ཁྱོད་བཞུགས་ནས། །འདུ་ཤེས་ཡོངས་སུ་མ་མཁྱེན་ཏམ། །
en: Didn’t you fully understand perception While on the seat of awakening?”

source: ངས་ནི་འདུ་ཤེས་ཡོངས་ཤེས་ཏེ། །
en: “I fully understand perception,

source: ང་ལ་འདུ་ཤེས་ཡོད་མ་ཡིན། །
en: And I myself have no perceptions.

source: ཁྱོད་ཉིད་ལ་ནི་སྙིང་བརྩེ་བས། །ཁང་པ་སྟོང་པ་འདིར་འོངས་སོ། །
en: Rather, it is out of love for you That I have come to this deserted house.”

source: སེམས་ཅན་དག་ནི་བར་འགའ་ཡང་། །གང་ཚེ་ཤིན་ཏུ་མི་དམིགས་པ། །
en: “When, no matter how hard you look, Sentient beings are never to be found,

source: དེ་ཚེ་ཐུགས་རྗེ་གང་དུ་བྱུང་། །ཁྱོད་ནི་སུ་ལ་ཐུགས་བརྩེ་མཛད། །
en: Where does compassion arise?Toward whom is your love directed?”

source: བདག་མེད་ཞི་བ་སྟོང་པ་ཉིད། །སེམས་ཅན་འདི་དག་མི་ཤེས་ཏེ། །
en: “These beings do not know emptiness, The peace of no self-identity;

source: དེ་དག་ཉིད་ལ་སྙིང་བརྩེའི་ཕྱིར། །བསོད་ནམས་སྤྱད་པ་སྤྱོད་པ་ཡིན། །
en: And so, out of love for those very beings, I engage in meritorious action.”

source: སྟོང་པ་ཞི་བར་ཐུགས་ཆུད་ནས། །
en: “Although he has fathomed the empty and tranquil,

source: ཞི་བ་སྟོང་པ་ཉིད་མཁྱེན་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་ད་དུང་དུ། །ཕྱིན་ཅི་ལོག་ཀྱང་མ་སྤངས་སམ། །
en: And realized tranquil emptiness, Could it be that the Tathāgata Still has not rid himself of error?”

source: ཞི་བ་སྟོང་པ་ཉིད་རྟོགས་ནས། །
en: “Having realized the peace of emptiness,

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་བྱའི་ཕྱིར། །འདྲེན་པ་ཆོས་སྟོན་མཛད་པ་འདི། །
en: The Guide delivers this Dharma teaching In order to mature beings.

source: སངས་རྒྱས་རྣམས་ཀྱི་ཐུགས་རྗེ་ཡིན། །
en: That is the compassion of the buddhas.”

source: དེ་བཞིན་གཤེགས་པ་ད་དུང་དུ། །ཁྱོད་ཀྱིས་ཕྱིན་ཅི་ལོག་མ་སྤངས། །
en: “Tathāgata, yet again, You have not rejected your error.

source: སེམས་ཅན་འདུ་ཤེས་མ་མཆིས་ན། །ཐུགས་རྗེ་གང་དུ་སྐྱེ་བར་འགྱུར། །
en: If there is no perception of beings, Where could compassion possibly arise?”

source: བྱང་ཆུབ་སེམས་ནི་རབ་བཟུང་ནས། །ཡོད་མིན་སེམས་ཅན་རྣམས་ལ་ཡང་། །
en: “Having embraced well the awakening mind, Superior people don their armor

source: མི་མཆོག་རྣམས་ནི་གོ་གྱོན་པ། །རང་བྱུང་རྣམས་ཀྱིས་བྱིན་རླབས་སོ། །
en: And naturally bestow blessings Upon nonexistent beings.”

source: དངོས་པོ་གང་ནའང་མི་དམིགས་པས། །གོ་ཆ་ཐམས་ཅད་བརྫུན་པ་ལགས། །
en: “Since nowhere is an entity observed, All armor, in fact, is unreal.

source: དངོས་པོ་མ་མཆིས་ཆོས་རྣམས་ལ། །གོ་ཆ་དམིགས་པ་མ་མཆིས་སོ། །
en: For phenomena that have no substance, There is no armor to be found.”

source: ཆོས་རྣམས་དངོས་པོ་ཡོད་མིན་ཡང་། །སྲོག་ཆགས་རྣམས་ལ་ཆོས་སྟོན་འདི། །
en: “Although phenomena have no substance, This Dharma taught to living creatures

source: འཇིག་རྟེན་མགོན་པོ་སྐྱོབ་རྣམས་ཀྱི། །ཐུགས་རྗེས་རྣམ་པར་རོལ་པ་ཡིན། །
en: Is the vibrant display of compassion Of the lord protectors of the world.”

source: ཆོས་ནི་ཡི་གེ་མ་མཆིས་ན། །
en: “As for Dharma, if words do not exist,

source: བཤད་པ་གུད་ན་ག་ལ་མཆིས། །
en: Where else could instructions be?

source: འཇིག་རྟེན་རྣམས་ལ་སླུ་མཛད་དམ། །
en: Might you be misleading worldly beings?

source: ཆོས་མ་ལགས་པ་ཆོས་བཤད་དམ། །
en: Or are you teaching Dharma that is not Dharma?”

source: ང་ནི་འཇིག་རྟེན་སླུ་མ་ཡིན། །
en: “I do not deceive the world.

source: ཆོས་མ་ཡིན་པའང་ང་མི་སྨྲ། །
en: Nor do I profess what is not Dharma.

source: ཕྱིན་ཅི་ལོག་གྱུར་སེམས་ཅན་གྱི། །ཉོན་མོངས་སེལ་བར་ང་བྱེད་དོ། །
en: What I do is remove the mental disturbances Of mistaken beings.”

source: ཉོན་མོངས་རྩ་བ་མ་མཆིས་ཏེ། །
en: “As a root of mental disturbances does not exist,

source: ནང་ངམ་ཕྱི་རོལ་རྣམས་ན་ཡང་། །དེ་དག་རྣམས་ཀྱི་གནས་མ་མཆིས། །
en: They have no location, Neither inside nor outside.

source: ཉོན་མོངས་ཇི་ལྟར་རྣམ་པར་སྦྱང་། །
en: So how can mental disturbances be purified?”

source: ཕྱིན་ཅི་ལོག་ལས་བྱུང་བ་རྣམས། །ཡོངས་སུ་བརྟགས་ལས་སྐྱེས་པ་སྟེ། །
en: “Things that arise from error Are born entirely of imputation;

source: རྟོག་པ་ཐམས་ཅད་སྤང་བའི་ཕྱིར། །སྲོག་ཆགས་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །
en: And so, to rid them of all concepts, I teach the Dharma to living beings.”

source: རྣམ་བརྟག་མང་པོ་ཅི་འཚལ་ཏེ། །
en: “No matter how many imputations you seek,

source: སེམས་ནི་རང་བཞིན་འོད་གསལ་ཞིང་། །
en: Mind is by nature luminosity

source: དེ་ལ་ཉོན་མོངས་མི་འབྱུང་སྟེ། །
en: In which mental disturbance does not occur

source: ནམས་ཀྱང་ཉོན་མོངས་དེ་མི་འགྱུར། །
en: And which never becomes disturbed.”

source: ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ཏེ། །
en: “It is just as you say—

source: སེམས་ནི་རྟག་ཏུ་འོད་གསལ་ཀྱང་། །བློ་བུར་ཉེ་བའི་ཉོན་མོངས་ཀྱིས། །
en: Mind is ever luminous, and yet Provisional, proximal disturbances

source: སོ་སོའི་སྐྱེ་བོ་ཉོན་མོངས་འགྱུར། །
en: Disturb the minds of ordinary beings.”

source: ཉོན་མོངས་དམིགས་སུ་མ་མཆིས་ཏེ། །
en: “If mental disturbances are not there to see

source: དེ་དག་ཕྱོགས་ན་མི་གནས་ན། །
en: And are not present from their own side,

source: བློ་བུར་དུ་ནི་ཇི་ལྟར་འགྱུར། །
en: How can they be provisional?

source: དེ་ཞུས་བདག་ལ་བཤད་དུ་གསོལ། །
en: That is the question; please explain this to me.”

source: དཔེར་ན་སྤྲིན་རྣམས་བར་སྣང་ལ། །སྣང་ཡང་དེ་དག་དེ་བཞིན་མིན། །
en: “Consider how clouds appear in the sky, But are not as they appear.

source: ཉོན་མོངས་འབྱུང་བའང་དེ་འདྲ་སྟེ། །
en: The arising of mental disturbances is like that;

source: སྣང་ཡང་དེ་དག་དེ་བཞིན་མིན། །
en: They too appear, yet are not that way.”

source: མ་ནོར་དེ་བཞིན་གང་ལགས་པ། །ཆོས་གནས་ཉིད་དེ་ཆོས་ཉིད་དོ། །
en: “Any phenomenon unmistaken in nature Simply remains that way; that is how it is.

source: མ་ནོར་དེ་བཞིན་ཉིད་ཆོས་ལ། །ནོར་བའི་དེ་བཞིན་ཉིད་མི་དམིགས། །
en: No mistaken nature can be seen In a phenomenon whose nature is unmistaken.”

source: བྱིས་པ་འདུ་ཤེས་ལྡན་རྣམས་ཀྱིས། །ལོག་པར་རྣམ་པར་གང་བརྟགས་པ། །
en: “It is those with childish perception Who falsely conceive such things to be,

source: བློ་དེ་རྟོགས་པར་བྱ་བའི་ཕྱིར། །དེ་བཞིན་གཤེགས་རྣམས་འབྱུང་བ་ཡིན། །
en: And tathāgatas who appear in order To bring their minds to realization.”

source: སྐྱེ་མ་མཆིས་པས་རབ་ཕྱེ་བ། །རྫོགས་པའི་སངས་རྒྱས་གང་ཞིག་བྱུང་། །
en: “Considering they are not born, Which perfect buddhas could appear?

source: སྐྱེ་བ་མ་མཆིས་ཆོས་རྣམས་ལ། །སངས་རྒྱས་འབྱུང་བ་འཐད་མ་ལགས། །
en: The appearance of a buddha makes no sense Where phenomena themselves have no birth.”

source: སྐྱེ་བ་མེད་པར་སྐྱེ་བ་ནི། །སངས་རྒྱས་འབྱུང་བ་རབ་ཏུ་བསྟན། །
en: “The appearance of a buddha Is explained as birthless birth,

source: ཀུན་རྫོབ་ཐ་སྙད་བཏགས་པ་སྟེ། །དམ་པའི་དོན་དུ་ཡོད་མ་ཡིན། །
en: A conventional designation That ultimately does not exist.”

source: ད་དུང་ཁྱོད་ལ་དོན་དམ་དང་། །ཀུན་རྫོབ་འདུ་ཤེས་གཉིས་མངའ་སྟེ། །
en: “You still have two perceptions, One conventional and one ultimate,

source: ཐེག་པ་གཅིག་ལམ་འགལ་འགྱུར་བ། །གཽ་ཏམ་ཁྱོད་ཀྱིས་བཀའ་སྩལ་ཏོ། །
en: Which contradicts the path of one vehicle That you profess, Gautama.”

source: ང་ནི་ལམ་དང་འགལ་མི་བྱེད། །
en: “I do not transgress the path;

source: འགལ་བ་མེད་པར་ང་གནས་ཏེ། །
en: I remain without contradiction and,

source: མི་འཐུན་སེམས་ཅན་སྡུམས་ཀྱང་བྱེད། །
en: moreover, Bring discordant beings into harmony.

source: ཁྱེའུ་ཁྱོད་དེ་ལྟར་ཤེས་པར་གྱིས། །
en: That is how you should understand it, child.”

source: སེམས་ཅན་དེ་ནི་མི་དམིགས་ན། །
en: “If those beings are not perceived,

source: གཽ་ཏ་མ་ཁྱོད་ཅི་སྡུམས་མཛད། །
en: Then to whom, Gautama, are you bringing harmony?

source: ཆོས་རྣམས་སྔོན་གྱི་མཐའ་ལ་གཟིགས། །གང་གི་ཀུན་ནས་ཉོན་མོངས་སྐྱེ། །
en: When you look at the past of phenomena—To whom has affliction arisen?”

source: སྔོན་གྱི་མཐའ་དང་ཕྱི་མཐའ་དང་། །དེ་བཞིན་ད་ལྟར་བྱུང་བ་དང་། །
en: “Having comprehended the past, the future, And likewise what transpires right now,

source: བྱང་ཆུབ་དམ་པ་རྟོགས་གྱུར་ནས། །སྲོག་ཆགས་རྣམས་ལ་ཆོས་སྟོན་ཏོ། །
en: Having realized sacred awakening, I teach the Dharma to living creatures.”

source: རྫོགས་སངས་རྒྱས་ཞེས་སྒྲོགས་མཛད་ཅིང་། །ཉིད་ཀྱི་མཁྱེན་པ་སྒྲོགས་མཛད་དེ། །
en: “You proclaim yourself the perfect Buddha, And proclaim your own understanding;

source: འདི་ལྟར་བདག་ཏུ་སྒྲོ་འདོགས་པས། །ཁྱོད་ནི་ལྷག་པའི་ང་རྒྱལ་ཆེ། །
en: Promoting yourself in this manner, Your pride must be truly exceptional!”

source: ང་ནི་བདག་ལ་མི་སྟོད་དེ། །དེ་བཞིན་གཞན་ལ་བརྙས་མི་བྱེད། །
en: “I do not laud myself, Nor do I belittle others.

source: དེ་བཞིན་ཉིད་ནི་རབ་ཏུ་སྟོན། །དེས་ན་དེ་བཞིན་གཤེགས་ཞེས་བྱ། །
en: I clearly reveal how things truly are, And so am called the Tathāgata.”

source: བརྗོད་དུ་མ་མཆིས་དེ་བཞིན་ཉིད། །དེ་ན་དེ་ཉིད་མ་མཆིས་ན། །
en: “If how things truly are is inexpressible And without a true nature,

source: སྒྲ་སྐད་མ་མཆིས་སྒྲ་བཤད་པ། །མཁྱེན་བཞིན་ལོག་པར་བཀའ་མ་སྩལ། །
en: Then don’t speak contrary to your own understanding, Using terminology for what has no words, no language.”

source: ཆོས་དེ་ཐམས་ཅད་ལོག་པ་སྟེ། །
en: “Although all those phenomena are contrary,
